Repository: Drake63/DxfReader
Catalog: DxfOpen/Properties/Resources.*.resx
Languages: ru_ru

# dialogAboutProduct
source: About program
ru_ru: Информация о приложении

# dialogActWithPoints
source: What to do with dots?
ru_ru: Укажите, что требуется сделать:

# dialogButtonCancel
source: Cancel
ru_ru: Отмена

# dialogButtonCreate
source: Create
ru_ru: Создать

# dialogButtonModify
source: Modify
ru_ru: Изменить

# dialogButtonRun
source: OK
ru_ru: Выполнить

# dialogComputerName
source: Computer name:
ru_ru: Имя компьютера:

# dialogConvertPolyline
source: Modify polylines
ru_ru: Преобразовывать полилинии

# dialogDeleteAll
source: remove all
ru_ru: удалить все

# dialogDescription
source: The program opens and modifies DXF files.
ru_ru: Приложение предназначено для открытия и оптимизации файлов DXF, удаления из них лишнего содержимого и уменьшения размера

# dialogEllipses
source: Modify ellipses
ru_ru: Преобразовывать эллипсы

# dialogFoundPoints
source: The document {0} {1} {2}
ru_ru: В документе {0} {1} {2}

# dialogIgnoreOtherLine
source: Skip all objetcs
ru_ru: Пропускать все объекты

# dialogLWPolyline
source: Create LWPOLYLINE
ru_ru: Создавать LWPOLYLINE

# dialogMarkup
source: Marking
ru_ru: Разметка

# dialogMoveToZero
source: Move all to the origin
ru_ru: Все на начало координат

# dialogNameProfile
source: Profile name:
ru_ru: Имя профиля:

# dialogOpenContour
source: Not closed shape
ru_ru: Незамкнутый контур

# dialogPrecision
source: Precision:
ru_ru: Точность:

# dialogProduct
source: Program:
ru_ru: Приложение:

# dialogProductVersion
source: Version:
ru_ru: Версия:

# dialogR13
source: Create R13
ru_ru: Создать R13

# dialogSaveFile
source: Save the file for the changes to take effect
ru_ru: Чтобы изменения вступили в силу, сохраните файл

# dialogSelectAs
source: mark as:
ru_ru: пометить как:

# dialogStringPoint
source: point.
ru_ru: точка.

# dialogStringPoints
source: points.
ru_ru: точки.

# dialogStringPoints2
source: points.
ru_ru: точек.

# dialogSystemInfo
source: About system
ru_ru: Информация о системе

# dialogSystemName
source: System:
ru_ru: Система:

# dialogTitleAbout
source: About Dxf Reader v2.1 program
ru_ru: О программе Dxf Reader v2.1

# dialogTitleModify
source: Editing the {0} profile
ru_ru: Редактирование профиля {0}

# dialogTitleModifyPoints
source: Changing points
ru_ru: Изменение точек

# dialogTitleNew
source: Creation a new profile
ru_ru: Создание нового профиля

# dialogTitleView
source: Viewing of the {0} profile
ru_ru: Просмотр профиля {0}

# dialogTooltipConvertPolyline
source: If a polyline contains bulges, it will be broken down into simpler entities
ru_ru: Если полилиния содержит коэффициент искривлённости, то она будет разбита на более простые объекты

# dialogTooltipEllipses
source: If the document contains Elliptical Arc, it will be converted to a polyline
ru_ru: Если эллипс является не полным, преобразовывать его в полилинию

# dialogTooltipIgnoreOtherLine
source: If the entities are not a primary line, a marking, or a non-closed shape, they will be added to the document
ru_ru: Пропускать объекты, которые не являются основной линией, разметкой или незамкнутым контуром

# dialogTooltipLWPolyline
source: Such a polyline takes up less disk space
ru_ru: Такая полилиния занимает меньше места на диске

# dialogTooltipMoveToZero
source: Move everythink to the origin
ru_ru: Перемещать все на начало координат, чтоб левый нижний угол совпал с координатой 0,0

# dialogTooltipR13
source: Create a document AC2012 version
ru_ru: Создавать документ версии AC1012

# dialogUser
source: User:
ru_ru: Пользователь:

# docCreated
source: Done. Total strings: {0}
ru_ru: Готово. Всего строк: {0}

# docNotCreated
source: Document not created
ru_ru: Документ не создан

# ErrorHeader
source: Error
ru_ru: Ошибка

# menuAbout
source: About program
ru_ru: О программе

# menuDeleteProfile
source: Remove the profile…
ru_ru: Удалить профиль…

# menuEdit
source: _Edit
ru_ru: П_равка

# menuEditProfile
source: Edit current profile
ru_ru: Редактировать текущий профиль

# menuExit
source: Exit
ru_ru: Выход

# menuFile
source: _File
ru_ru: _Файл

# menuHelp
source: _Help
ru_ru: _Справка

# menuOpen
source: Open...
ru_ru: Открыть...

# menuPoints
source: Edit or delete points...
ru_ru: Изменить или удалить точки...

# menuPrint
source: Print...
ru_ru: Печать...

# menuProfile
source: _Profile
ru_ru: _Профиль

# menuRefresh
source: Refresh
ru_ru: Обновить

# menuSave
source: Save
ru_ru: Сохранить

# menuSaveAs
source: Save as...
ru_ru: Сохранить как...

# menuSelectProfile
source: Select profile
ru_ru: Выбрать профиль

# menuShowMenu
source: Show menu bar
ru_ru: Показать строку меню

# menuShowStatusBar
source: Show status bar
ru_ru: Показать строку состояния

# menuShowText
source: Show text
ru_ru: Показать текст

# menuShowToolBar
source: Show tool bar
ru_ru: Показать панель инструментов

# menuShowVisual
source: Show image
ru_ru: Показать изображение

# menuSpline
source: Modify splines
ru_ru: Преобразовать сплайны

# menuView
source: _View
ru_ru: _Вид

# menuViewProfile
source: View permanent profile
ru_ru: Просмотр постоянного профиля

# msgCreateProfErrorTitle
source: Creating profile error
ru_ru: Ошибка создания профиля

# msgErrorTitle
source: Error
ru_ru: Ошибка

# msgNotDxf
source: This file is not a DXF file
ru_ru: Указанный файл не является файлом DXF

# msgNotSaveFile
source: File {0} has not been saved. Do you want to save it before you open a new one?
ru_ru: Файл "{0}" не был сохранен. Вы хотите сохранить его прежде, чем открыть новый?

# msgOpenFileErrorTitle
source: Error
ru_ru: Ошибка открытия файла

# msgPathNotFind
source: The path not found
ru_ru: Указанный путь не найден

# msgPrintError
source: The document was not created.
ru_ru: Документ не был создан, нельзя распечатать пустой документ

# msgPrintErrorTitle
source: Error
ru_ru: Ошибка вывода не печать

# msgProfileDelete
source: Are you sure you want to delete the profile '{0} '?
ru_ru: Вы действительно хотите удалить профиль "{0}"?

# msgProfileDelTitle
source: Profile deleting
ru_ru: Подтверждение удаления профиля

# msgProfNameEmpty
source: Profile name cannot be empty
ru_ru: Имя профиля не может быть пустым

# msgSavaModFileTitle
source: Saving changes
ru_ru: Сохранение изменений

# msgSaveFileTitle
source: Saving file
ru_ru: Сохранение файла

# msgSaveModifiedFile
source: The file has been changed, save the changes?
ru_ru: Файл был изменен, сохранить изменения в файле?

# msgSaveProfErrorTitle
source: Error
ru_ru: Ошибка сохранения профилей

# msgSmallPrecision
source: The precision cannot be less 2
ru_ru: Точность не может быть меньше 2

# msgWritingFileErrorTitle
source: Error writing file {0}
ru_ru: Ошибка записи файла {0}

source: No objects
ru_ru: Объектов нет

source: Objects count:
ru_ru: Количество объектов:

# openDialogFilters
source: DXF AutoCad files|*.dxf
ru_ru: Файлы DXF AutoCad|*.dxf

# profileBase_1
source: General
ru_ru: Основной

# sizeToString
source: Width: {0} mm; Height: {1} mm
ru_ru: Ширина: {0} мм; Высота: {1} мм

# timeText
source: Time: {0} sec.
ru_ru: Затрачено: {0} сек.

# tooltipAbout
source: Help Contents (F1)
ru_ru: Содержание справки (F1)

# tooltipDelProfile
source: Delete current profile (Del)
ru_ru: Удалить текущий профиль (Del)

# tooltipEditProfile
source: Edit current profile (Ctrl+R)
ru_ru: Редактировать текущий профиль (Ctrl+R)

# tooltipExit
source: Exit (Alt+X или Esc)
ru_ru: Закрыть приложение (Alt+X или Esc)

# tooltipNewProfile
source: Create a new profile (Ctrl+N)
ru_ru: Создать новый профиль (Ctrl+N)

# tooltipOpenFile
source: Open DXF file and view it (Ctrl+O)
ru_ru: Открыть файл DXF и отобразить его содержимое (Ctrl+O)

# tooltipPoints
source: Delete or change points (Ctrl+.)
ru_ru: Удалить или изменить точки (Ctrl+.)

# tooltipPrecisionBySpline
source: The precision with which you want to convert splines into polylines
ru_ru: Точность, с которой требуется преобразовывать сплайны в полилинии

# tooltipPrint
source: Pint the image (Ctrl+P)
ru_ru: Печать изображения (Ctrl+P)

# tooltipReloadFile
source: Reload file (F5)
ru_ru: Перезагрузить файл (F5)

# tooltipSaveFile
source: Save file (Ctrl+S)
ru_ru: Сохранить файл (Ctrl+S)

# tooltipSpline
source: Modify splines to polylines (F2)
ru_ru: Преобразовать сплайны в полилинии (F2)

# tooltipViewProfile
source: View permanent profile (F6)
ru_ru: Просмотр постоянного профиля (F6)

# menuHelpContents
source: Help Contents
ru_ru: Содержание

# helpFileName
source: DxfReader.chm
ru_ru: ru-Ru/DxfReader.chm

# dialogFoundPointsContains_1
source: contains
ru_ru: обнаружена

# dialogFoundPointsContains_2
source: contains
ru_ru: обнаружено

# mutexTimeout
source: Timeout waiting for exclusive access
ru_ru: Тайм-аут, ожидающий эксклюзивного доступа

# menuOnlyOneWindow
source: _Open all files in the current window
ru_ru: _Открывать все файлы в текущем окне
